function getRandomInt(max) {
    return Math.floor(Math.random() * max);
}

var titles = [
   "По мапі розкидані тварини, на яких можна полювати щоб отримати їжу, або щоб продати їхнє м’ясо за кришечки.",
   "Ви можете вирощувати культури на гідропонній фермі, для вживання або на продаж. Деякі культури використовуються в крафтах.",
   "Деякі місця пустки забруднені радіацією. Тримайтеся подалі, якщо звичайно, не хочете стати гулем!",
   "Гулі – це люди, вражені Вірусом Рукотворної Еволюції (ВРЕ) та радіацією. Після ядерної війни ВРЕ вирвався із лабораторій West tech і попав в атмосферу планети.",
   "Ядерна війна сталась 23 жовтня 2077го року, в наслідок війни за останні поклади нафти на Алясці, що тривала майже 20 років між китаєм та США, хоча до цього ядерну зброю локально використовували в конфліктах на ближньому сході.",
   "Ядерна війна у всесвіті Fallout тривала всього 2 години.",
   "Кігті смерті були розроблені владою США ще до ядерної війни. Ці істоти є найнебезпечнішими мутантами на американьских пустках.",
   "В світі Fallout вся нафта на планеті підійшла кінця в 2050х, нестача нафти стала причиною початку ресурсних війн по всьому світові.",
   "До 2077го року США захопила Мексику, анексувала Канаду, відбила Аляску та захопила велику частину Китаю в ході війни. Ні Канада, ні мексика не були раді окупації і чинили опір.",
   "По мапі розкидана велика кількість прихованих локацій, в деяких з них можна знайти щось цікаве…",
   "Досліджуйте мапу щоб знайти ресурси, цікавинки та РП-взаємодію з гравцями.",
   "Довоєнний світ охопила епідемія «Нової чуми». В спробах знайти вакцину, вчені випадково створили ВРЕ – Вірус рукотворної Еволюції, потужний мутаген.",
   "НКР, фактично, не мала жодного успіху у війні проти легіону цезаря окрім як відбиття дамби гувера та захоплення одного центуріона.",
   "Легіон цезаря не є повністю технофобною фракцією. Нехай вони і не покладаються так сильно на технології, але вони все таки використовують високотехнологічну зброю.",
   "Супермутанти це породження ВРЕ. Перше покоління мутантів було розумним і майже повністю краще за людей, проте були стерильні. Друге покоління було куди дурніше.",
   "Нехай супермутанти і стерильні, проте як виявилось, з часом їхнє лібідо повертається.",
   "Транзистери в фаллаут було винайдено в 2070х роках, а не в 1950х.",
   "Роботи стали повсякденним аспектом життя, піонером в робоіндустрії стала корпорація Роберта Хауса – РобКо індастріз.",
   "Якщо ви побачили велику, прямоходячу рогату ящерку, то ТІКАЙТЕ НАХУЙ БЛЯЯЯ",
   "В лорі нічого не сказано про відсутність одностатевих оргій в рядах анклаву.",
   "Силова броня була створена як альтернатива танкам, оскільки танки вимагали дефіцитне паливо, а заряджати танк тоннами енергії – не варіант.",
   "Нехай легіон і деспотична фракція, вони також мають свої об’єктивні плюси.",
   "Новобранці НКР проходять всього 2 тижні підготовки перед відправкою на фронт.",
   "Щорічно НКР втрачала по одній тисячі людей на дамбі гувера (Період між першою і до другої битви за дамбу). Під час першої битви за дамбу гувера НКР втратила приблизно 180 бійців і рейнджерів.",
   "Рейнджери НКР не мають званнь, не підчіняються молодшим командирам НКР, але залежно від ситуації та наказів від командира рейнджерів, ситуація може змінитись.",
   "В армїї НКР можуть служити супермутанти і гулі і законодавчо заборонена будь-яка дискримінація.",
   "Середньостатистичний воїн Легіона Цезаря сильніший за такого самого бійця НКР.",
   "Легіон дозволяє жити поселенням під своєю владою, зберігаючи бізнеси які не противорічать ідеології та законам легіона.",
   "Бункервілл – місто збудоване вихідцями із сховища 7. Зараз це є нейтральним і незалежним, має свої бізнеси, громадян, шерифів та салун.",
   "На сервері 2282й рік, кілька місяців після другої битви за дамбу гувера, в якій вона була повністю знищена.",
   "Ви вільні відігрувати в межах встановленої ролі та сеттінгу як забажаєте. Ціль проєкту – дати людям розважатися і відігрувати ролі в сеттінгу фаллаута.",
   "Всього сховищ було збудувано 217. Більшість з них, правда, предназначались для експерементів над людьми.",
   "Щоб здобути зброю, ви повинні або скрафтити її, здобути з мертвих гравців, знайти у випадкових локаціях, отримати за вступ до фракції чи як нагороду за завдання. Зброя втрачається при смерті, тож будьте обережні.",
   "Використовуйте ООС (Нон-РП) чат через //, якщо у вас виникло питання або проблема.",
   "Використовуйте команду /dropmoney (сумма) щоб скинути свої гроші на землю, щоб розплатитись з іншими гравцями або задля інших цілей. Гроші, скинуті одне на одного додаються, і перетворюються на одну купку.",
   "Не використовуйте мета-інформацію (МЕТА - Інформація, здобута нон-рп шляхом, яка відома вам, як гравцю, але не вашому персонажу.)",
   "Ви можете продавати та скуповувати різні речі через механіку ринку на сервері. Просто підійдіть до прилавків в Бункервіллі та оберіть що вам потрібно.",
   "Ви можете давати оголошення через персональний термінал (ентіті) за 100 кришечок, який видно всім і є РП-інформацією.",
   "В Бункервілл заборонено заходити всім крупним фракціям (Легіон, НКР, БС, Анклав і подібні) без вагомої причини.",
   "Супермутанти та гулі сприймаються жителями пустки за потвор і виродків, але не всі люди такої думки. Майте це на увазі під час РП.",
   "Гулям, як і супермутантам теж потрібно харчуватися, пити та відпочивати",
   "Падаючі на голову пропи заспавлені адміном які вас вбивають – частина РП процесу.",
   "Всі фракції контролюються виключно звичайними гравцями, всі їхні дії та відіграш керується виключно гравцями, дивлячись на їхні мотиви та цілі, проте адміністрація може тимчасово долучитись до якоїсь із фракцій для короткотривалого відіграшу та розваги гравців.",
   "Старайтесь писати ім’я та фамілію свого персонажа англійськими буквами, уникати імен знаменитих людей та лорних персонажів.",
   "Ознайомтесь з правилами серверу на нашому офіційному діскорд-каналі.",
   "На сервері трапляються хімічні дощі, майте це на увазі.",
   "Головне правило – розважатись, та давати розважатись іншим.",
   "Ви вільні будуватись де завгодно окрім вже зайнятих локацій та місць з лутом.",
   "Пропи, розміщенні задля потреб фракції (Оформлення бази, збудовані споруди, станції крафтів та інше) можуть бути збережені на сервері назавжди (Допоки ваша фракція активна та невідбулось подій, пов’язаних зі знищенням пропів та інш). Просто попросіть адмінів, і вони зроблять це."
];

var Backgrounds = [
   "images/backgrounds/loading_posters01.jpg",
   "images/backgrounds/loading_posters02.jpg",
   "images/backgrounds/loading_posters03.jpg",
   "images/backgrounds/loading_magazines01.jpg",
   "images/backgrounds/loading_magazines02.jpg",
   "images/backgrounds/loading_magazines03.jpg",
   "images/backgrounds/loading_desktop01.jpg",
   "images/backgrounds/loading_desktop02.jpg",
   "images/backgrounds/loading_desktop03.jpg",
   "images/backgrounds/loading_desktop04.jpg",
   "images/backgrounds/loading_desktop05.jpg",
   "images/backgrounds/loading_desktop06.jpg",
   "images/backgrounds/loading_desktop07.jpg",
   "images/backgrounds/loading_desktop08.jpg",
   "images/backgrounds/loading_bulletinboard01.jpg",
   "images/backgrounds/loading_bulletinboard02.jpg",
   "images/backgrounds/loading_bulletinboard03.jpg",
   "images/backgrounds/loading_bulletinboard04.jpg",
   "images/backgrounds/loading_bulletinboard05.jpg",
   "images/backgrounds/loading_bulletinboard06.jpg",
   "images/backgrounds/loading_bulletinboard07.jpg",
   "images/backgrounds/loading_bulletinboard08.jpg",
   "images/backgrounds/loading_bulletinboard09.jpg",
   "images/backgrounds/loading_building01.jpg",
   "images/backgrounds/loading_building02.jpg",
   "images/backgrounds/loading_building03.jpg",
   "images/backgrounds/loading_billboard01.jpg",
   "images/backgrounds/loading_billboard02.jpg",
   "images/backgrounds/loading_billboard03.jpg",
   "images/backgrounds/loading_billboard04.jpg",
   "images/backgrounds/loading_billboard05.jpg",
   "images/backgrounds/loading_billboard06.jpg",
   "images/backgrounds/loading_billboard07.jpg",
   "images/backgrounds/loading_billboard08.jpg",
   "images/backgrounds/loading_billboard09.jpg",
]
var RandomText = getRandomInt(titles.length);
let RandomBackground = getRandomInt(Backgrounds.length);
var SwitchDelay = 10000;

const imgs = [document.getElementById('img1'),document.getElementById('img2')];
var elem = document.getElementById("toptext");
var counter = new Counter(elem, SwitchDelay);
counter.start();

let back=0;
let pause = false;

function imgLoaded() {

    imgs[back].style.animationDirection = 'normal';
    back = (back + 1)%2;
    imgs[back].style.animationDirection = 'reverse';

    imgs[0].style.animationName = 'fade-in';
    imgs[1].style.animationName = 'fade-in';
}

function next() { 
    imgs[0].style.animationName ='nothing';
    imgs[1].style.animationName = 'nothing';

    imgs[back].style.opacity = 0;
    imgs[(back+1)%2].style.opacity = 1;

    RandomBackground = getRandomInt(Backgrounds.length);
    imgs[back].src = Backgrounds[RandomBackground]
    
}

function Counter(elem, delay) {
    var interval;
    elem.innerText = titles[RandomText];
    imgs[0].src = Backgrounds[RandomBackground]
    imgs[1].src = Backgrounds[RandomBackground]
    
   
    function updateDisplay(value) { elem.innerText = value; next()}
    function run() {RandomText = getRandomInt(titles.length); updateDisplay(titles[RandomText]); }
    function start() { interval = window.setInterval(run, delay); }

    this.start = start;
}

